[UI_TREE]
EDITCfg=編輯設置
MARKCfg=打標設置
3DCfg=3D設置
ImportDxf_Type0Cfg=DXF導入設置
SysCfg=其他設置

[Edit]
EDIT=編輯設置
PointFilterPrecis=濾點精度(mm)
PointFilterAngle=濾點角度(度)
PointPrecisMoveStep=點移動步長(mm)
MICRO=位置微調步長(mm)
MICROROTATE=角度微調步長(度)
CLICK=拾取精度(mm)
UNDO=級數回滾級數
ONETOTWO=中斷點精度(mm)
ExtendSpace=縮擴精度(mm)
KillAngleSpace=導角精度(mm)
PreViewZoomScale=預覽縮放比例
LayerCnt=層級數
JoinDistance=曲線合併最大距離
FastDrawEnable=填充線顯示提速
FastDrawEnableOption=關閉|啟動

[MARK]
MARK=打標設置
SafeDoorRemark=安全門閉合是否繼續打標
SafeDoorRemarkOption=否|是
CloseRedIfMark=打標時是否自動關閉紅光
CloseRedIfMarkOption=否|是
RedPreviewLayerNo=紅光預覽速度
EnableMaxMarkNum=加工到指定數目後停止
EnableMaxMarkNumOption=否|是

[3D]
3D=3D設置
3dModelPrecision=3D模型處理精度
3dTrancePrecision=3D資料轉換精度
STLOptimize=STL模型貼圖優化
STLOptimizeOption=否|是


[ImportDxf_Type0]
ImportDxf_Type0=DXF導入設置
SepArc=圓弧精度(5~255)
SepSpLine=樣條曲線精度(5~255)

[Sys]
Sys=其他設置
CIRCLEPRECIS=圓弧精度(mm)
SAMPLECOUNT=圓弧每段采樣數
AIIMPORTPRECIS=AI文件導入精度(mm)
PowerFill=填充速度優化
PowerFillOption=否|是
PowerDraw=繪圖速度優化
PowerDrawOption=否|是
PowerRPViewFrame=紅光預覽邊框優化
PowerRPViewFrameOption=否|是


[UI_FACE]
ExportSysPara =導出參數...
ImportSysPara =導入參數...
Ok=確定
Cancel=取消
Apply=應用


;3DCALI_DLG_MAIN
[DLG_6000]
1019=打標參數設置
1021=打標
1022=紅光預覽
1023=循環打標
1024=導出校正表
1025=導入校正表
1027=電機基準點
1028=最小調節位置
1029=最大調節位置
1030=校正遞增量
1031=基準面焦距
1033=參數設置
6000=校正類型
6001=基本參數
6002=電機位置
3=生成校正表
4=重置


;3DCALI_DLG_PARAM
[DLG_140]
1035=打標次數
1036=打標速度(mm/s)
1037=空跳速度(mm/s)
1038=Q頻(kHz)
1039=Q釋放(us)
1040=電流(A)
1041=功率(%)
1042=模式
1051=應用
2=取消


;3DCALI STRING
[STRINGTABLE]
Motor position=電機位置
Current focus=當前焦距
Wrong motor parameters=電機參數錯誤
Motor movement failure=電機運動失敗
Motor increment out of range (0.01mm~5mm)=電機增量超出範圍(0.01mm~5mm)
Focus of base plane out of range (>0mm)=基準面焦距超出範圍(>0mm)
Cali data wrong,the focus must be monotonically increasing/decreasing=校正數據錯誤，焦距必須單調遞增/遞減
Cali file detected, generation will modify the original file. It is recommended to back up (Export) the file first. Are you sure to continue generating?=校正文件已存在，生成校正表會將原校正文件修改，建議備份（導出）後再生成。是否繼續生成？
Generating cali file false: Unable to open/create file=生成校正文件失敗：無法打開/創建文件
Generating cali file false: Unable to write file=生成校正文件失敗：無法寫入文件
Stop Marking=停止打標
Start Marking=開始打標
Failed to stop marking=停止打標失敗
Failed to start marking=停止打標失敗
Export success=導出成功
Export failed: Can not find cali file or copy file failed=導出失敗：找不到校正文件或拷貝文件失敗
Import failed: Cali file does not exist=導入失敗：校正文件不存在
Import failed: Unknow=導入失敗：未知錯誤
Cali file already exists, do you want to replace it=校正文件已存在，是否覆蓋？
Import success=導入成功
Import failed: Please manually copy the cali file to the '\\EMCC\\caliset\\%cardID%\\' directory=導入失敗：請手動將校正文件復製到 ' \EMCC\caliset\%cardID%\ ' 目錄下
Data is not enough, please input at lease 2 rows=數據太少，請輸入至少兩行數據
Generation of cali file succeeded=生成校正文件成功
Error: Handle of device.dll is null=錯誤：device.dll句柄為空
Error: Card number wrong=錯誤：卡序號錯誤
Error: Load device.dll or API failed=錯誤：加載device.dll或其API時失敗
Path of cali file wrong or SystemSet.ini not found=校正文件目錄錯誤或SystemSet.ini找不到
Error: Open 3dmarker.dat failed=錯誤：打開 3dmarker.dat文件失敗
Error: Open .dat failed=錯誤：打開.dat文件失敗
Error: Enter mark environment failed=錯誤：進入打標環境失敗
Error: Leave mark environment failed=錯誤：離開打標環境失敗
